author: Rod Soto, Jose Hernandez, Splunk
datamodel:
- Endpoint
date: '2020-11-06'
description: The search looks for files that contain the key word *Ryuk* under any
  folder in the C drive, which is consistent with Ryuk propagation.
how_to_implement: You must be ingesting data that records the filesystem activity
  from your hosts to populate the Endpoint Filesystem data-model object. If you are
  using Sysmon, you will need a Splunk Universal Forwarder on each endpoint from which
  you want to collect data.
id: 57d44d70-28d9-4ed1-acf5-1c80ae2bbce3
known_false_positives: If there are files with this keywoord as file names it might
  trigger false possitives, please make use of our filters to tune out potential FPs.
name: Ryuk Test Files Detected
references: []
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime FROM datamodel=Endpoint.Filesystem WHERE "Filesystem.file_path"=C:\\*Ryuk*
  BY "Filesystem.dest", "Filesystem.user", "Filesystem.file_path" | `drop_dm_object_name(Filesystem)`
  | `security_content_ctime(lastTime)` | `security_content_ctime(firstTime)` | `ryuk_test_files_detected_filter`'
tags:
  analytic_story:
  - Ryuk Ransomware
  asset_type: Endpoint
  automated_detection_testing: passed
  cis20:
  - CIS 8
  confidence: 100
  context:
  - source:endpoint
  - stage: Impact
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/malware/ryuk/windows-sysmon.log
  impact: 70
  kill_chain_phases:
  - Delivery
  message: A creation of ryuk test file $file_path$ in host $dest$
  mitre_attack_id:
  - T1486
  nist:
  - PR.PT
  - DE.CM
  observable:
  - name: dest
    role:
    - Victim
    type: Hostname
  - name: user
    role:
    - Victim
    type: user
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  risk_score: 70
  security_domain: endpoint
  cim_version: 5.0.0
  recommended_tas:
  - Splunk_TA_cisco-ucs
  - Splunk_TA_citrix-netscaler
  - Splunk_TA_nix
  - Splunk_TA_nginx
  - Splunk_TA_microsoft-iis
  - Splunk_TA_microsoft-sqlserver
  - Splunk_TA_rsa-securid
  - Splunk_TA_remedy
  - Splunk_TA_bluecoat-proxysg
  - Splunk_TA_aws-kinesis-firehose
  - Splunk_TA_rsa_securid_cas
  - Splunk_TA_jboss
  - Splunk_TA_websense-cg
  - Splunk_TA_ossec
  - Splunk_TA_bromium
  - Splunk_TA_nagios-core
  - Splunk_TA_isc-bind
  - Splunk_TA_bit9-carbonblack
  - Splunk_TA_snow
  - Splunk_TA_squid
  - Splunk_TA_apache
  - Splunk_TA_imperva-waf
  - Splunk_TA_juniper
  - Splunk_TA_cisco-esa
  - Splunk_TA_microsoft_sysmon
  - Splunk_TA_cisco-ise
  - splunk_ta_o365
  - Splunk_TA_f5-bigip
  - Splunk_TA_symantec-ep
  - Splunk_TA_google-cloudplatform
  - Splunk_TA_sophos
  - Splunk_TA_mcafee_epo_syslog
  - Splunk_TA_haproxy
  - Splunk_TA_tomcat
  - Splunk_TA_jmx
  - Splunk_TA_cyberark
  - Splunk_TA_symantec-dlp
  - Splunk_TA_ibm-was
  - Splunk_TA_microsoft-hyperv
  - Splunk_TA_windows
  - Splunk_TA_stream_wire_data
  - Splunk_TA_mcafee-wg
  - Splunk_TA_isc-dhcp
  - Splunk_TA_websense-dlp
  - Splunk_TA_box
  - Splunk_TA_microsoft-scom
  - Splunk_TA_CrowdStrike_FDR
  - Splunk_TA_rsa-dlp
  - Splunk_TA_cisco-wsa
  - Splunk_TA_mysql
  - Splunk_TA_cisco-asa
  - Splunk_TA_infoblox
  - Splunk_TA_salesforce
  - Splunk_TA_cyberark_epm
  - Splunk_TA_linux
  - Splunk_TA_oracle
  tas_with_data:
  - Splunk_TA_microsoft_sysmon
type: TTP
version: 1
