author: Rod Soto, Jose Hernandez, Splunk
datamodel:
- Endpoint
date: '2020-11-06'
description: The search looks for a Windows Security Account Manager (SAM) was stopped
  via command-line. This is consistent with Ryuk infections across a fleet of endpoints.
how_to_implement: You must be ingesting data that records the process-system activity
  from your hosts to populate the Endpoint Processes data-model object. If you are
  using Sysmon, you will need a Splunk Universal Forwarder on each endpoint from which
  you want to collect data.
id: 69c12d59-d951-431e-ab77-ec426b8d65e6
known_false_positives: SAM is a critical windows service, stopping it would cause
  major issues on an endpoint this makes false positive rare. AlthoughNo false positives
  have been identified.
name: Windows Security Account Manager Stopped
references: []
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime FROM datamodel=Endpoint.Processes WHERE ("Processes.process_name"="net*.exe"
  "Processes.process"="*stop \"samss\"*") BY "Processes.dest", "Processes.user", "Processes.process"
  | `drop_dm_object_name(Processes)` | `security_content_ctime(lastTime)` | `security_content_ctime(firstTime)`
  | `windows_security_account_manager_stopped_filter`'
tags:
  analytic_story:
  - Ryuk Ransomware
  asset_type: Endpoint
  automated_detection_testing: passed
  cis20:
  - CIS 8
  confidence: 100
  context:
  - Source:Endpoint
  - Stage:Defense Evasion
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/malware/ryuk/windows-sysmon.log
  impact: 70
  kill_chain_phases:
  - Delivery
  message: 'The Windows Security Account Manager (SAM) was stopped via cli by $user$
    on $dest$ by this command: $processs$'
  mitre_attack_id:
  - T1489
  nist:
  - PR.PT
  - DE.CM
  observable:
  - name: dest
    role:
    - Victim
    type: Endpoint
  - name: user
    role:
    - Victim
    type: User
  - name: process
    role:
    - Target
    type: Process
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  risk_score: 70
  security_domain: endpoint
  cim_version: 5.0.0
  recommended_tas:
  - Splunk_TA_cisco-ucs
  - Splunk_TA_citrix-netscaler
  - Splunk_TA_nix
  - Splunk_TA_nginx
  - Splunk_TA_microsoft-iis
  - Splunk_TA_microsoft-sqlserver
  - Splunk_TA_rsa-securid
  - Splunk_TA_remedy
  - Splunk_TA_bluecoat-proxysg
  - Splunk_TA_aws-kinesis-firehose
  - Splunk_TA_rsa_securid_cas
  - Splunk_TA_jboss
  - Splunk_TA_websense-cg
  - Splunk_TA_ossec
  - Splunk_TA_bromium
  - Splunk_TA_nagios-core
  - Splunk_TA_isc-bind
  - Splunk_TA_bit9-carbonblack
  - Splunk_TA_snow
  - Splunk_TA_squid
  - Splunk_TA_apache
  - Splunk_TA_imperva-waf
  - Splunk_TA_juniper
  - Splunk_TA_cisco-esa
  - Splunk_TA_microsoft_sysmon
  - Splunk_TA_cisco-ise
  - splunk_ta_o365
  - Splunk_TA_f5-bigip
  - Splunk_TA_symantec-ep
  - Splunk_TA_google-cloudplatform
  - Splunk_TA_sophos
  - Splunk_TA_mcafee_epo_syslog
  - Splunk_TA_haproxy
  - Splunk_TA_tomcat
  - Splunk_TA_jmx
  - Splunk_TA_cyberark
  - Splunk_TA_symantec-dlp
  - Splunk_TA_ibm-was
  - Splunk_TA_microsoft-hyperv
  - Splunk_TA_windows
  - Splunk_TA_stream_wire_data
  - Splunk_TA_mcafee-wg
  - Splunk_TA_isc-dhcp
  - Splunk_TA_websense-dlp
  - Splunk_TA_box
  - Splunk_TA_microsoft-scom
  - Splunk_TA_CrowdStrike_FDR
  - Splunk_TA_rsa-dlp
  - Splunk_TA_cisco-wsa
  - Splunk_TA_mysql
  - Splunk_TA_cisco-asa
  - Splunk_TA_infoblox
  - Splunk_TA_salesforce
  - Splunk_TA_cyberark_epm
  - Splunk_TA_linux
  - Splunk_TA_oracle
  tas_with_data:
  - Splunk_TA_microsoft_sysmon
type: TTP
version: 1
